УправлениеПаркомАтракционов/src/Documents/ПродажаБилета/ПродажаБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаБилета</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Атракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УправлениеПаркомАтракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Атракцион</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАтракционов/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Атракционы</name>
    <type>
      <types>CatalogRef.Атракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАтракционов/src/Documents/ПродажаБилета/ObjectModule.bsl
//Процедура ОбработкаПроведения(Отказ,Режим)
//	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//	//Данный фрагмент построен конструктором.
//	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
//
//	// регистр АктивныеПосещения
//	Движения.АктивныеПосещения.Записывать = Истина;
//	Движение = Движения.АктивныеПосещения.Добавить();
//	Движение.Период = Дата;
//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//	Движение.Основание = ссылка;
//	Движение.Атракцион = Атракцион;
//	Движение.КоличествоПосещений = 1;
//
//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//КонецПроцедуры
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Основание = ссылка;
	Движение.Атракцион = Атракцион;
	Движение.КоличествоПосещений = 1;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Атракционы = Атракцион;
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
